<a href="https://colab.research.google.com/github/leejyy/New/blob/master/Panda1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import numpy as np
import pandas as pd
labels=['a','b','c']
my_data=[10,20,30]
arr= np.array (my_data)
d={'a':10,'b':20,'c':30}
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(123)

In [9]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [12]:
df[['W','X']]

          W         X
A -0.805367 -1.727669
B  0.338589 -0.011830
C  0.978736  2.238143
D  1.743712 -0.798063
E  0.890706  1.754886

In [13]:
df

          W         X         Y         Z
A -0.805367 -1.727669 -0.390900  0.573806
B  0.338589 -0.011830  2.392365  0.412912
C  0.978736  2.238143 -1.294085 -1.038788
D  1.743712 -0.798063  0.029683  1.069316
E  0.890706  1.754886  1.495644  1.069393

In [21]:
df['new']=df['W']+df['Y']

In [22]:
df

          W         X         Y         Z       new
A -0.805367 -1.727669 -0.390900  0.573806 -1.196266
B  0.338589 -0.011830  2.392365  0.412912  2.730954
C  0.978736  2.238143 -1.294085 -1.038788 -0.315349
D  1.743712 -0.798063  0.029683  1.069316  1.773395
E  0.890706  1.754886  1.495644  1.069393  2.386351

In [24]:
df.drop('new',axis=1,inplace=True)

In [25]:
df

          W         X         Y         Z
A -0.805367 -1.727669 -0.390900  0.573806
B  0.338589 -0.011830  2.392365  0.412912
C  0.978736  2.238143 -1.294085 -1.038788
D  1.743712 -0.798063  0.029683  1.069316
E  0.890706  1.754886  1.495644  1.069393

In [27]:
df.drop('E',axis=0)

          W         X         Y         Z
A -0.805367 -1.727669 -0.390900  0.573806
B  0.338589 -0.011830  2.392365  0.412912
C  0.978736  2.238143 -1.294085 -1.038788
D  1.743712 -0.798063  0.029683  1.069316

In [29]:
df.loc['C']

W    0.978736
X    2.238143
Y   -1.294085
Z   -1.038788
Name: C, dtype: float64

In [32]:
df.iloc[2]

W    0.978736
X    2.238143
Y   -1.294085
Z   -1.038788
Name: C, dtype: float64

In [38]:
import pandas as pd
import numpy as np

In [36]:
data="/content/drive/MyDrive/Colab Notebooks/projects/MTA/data/MTAData.csv"

In [39]:
data=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/projects/MTA/data/MTAData.csv')

In [40]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112749 entries, 0 to 112748
Data columns (total 12 columns):
 #   Column                                                                Non-Null Count   Dtype
---  ------                                                                --------------   -----
 0   Unnamed: 0                                                            112749 non-null  int64
 1   C/A                                                                   112749 non-null  object
 2   UNIT                                                                  112749 non-null  object
 3   SCP                                                                   112749 non-null  object
 4   STATION                                                               112749 non-null  object
 5   LINENAME                                                              112749 non-null  object
 6   DIVISION                                                              112749 non-null  object
 7   DATE                                                                  112749 non-null  object
 8   TIME                                                                  112749 non-null  object
 9   DESC                                                                  112748 non-null  object
 10  ENTRIES                                                               112748 non-null  float64
 11  EXITS                                                                 112748 non-null  float64
dtypes: float64(2), int64(1), object(9)
memory usage: 10.3+ MB

In [41]:
data.head()

   Unnamed: 0  ... EXITS
0           0  ...                                          2401758.0
1           1  ...                                          2401764.0
2           2  ...                                          2401807.0
3           3  ...                                          2401889.0
4           4  ...                                          2401946.0

[5 rows x 12 columns]

In [47]:
MTAData=data.drop(['C/A','UNIT','DIVISION','DESC'],axis=1)

axis=1 refer to column

In [48]:
MTAData

        Unnamed: 0  ... EXITS
0                0  ...                                          2401758.0
1                1  ...                                          2401764.0
2                2  ...                                          2401807.0
3                3  ...                                          2401889.0
4                4  ...                                          2401946.0
...            ...  ...                                                ...
112744      112744  ...                                          1058880.0
112745      112745  ...                                          1059059.0
112746      112746  ...                                          1059067.0
112747      112747  ...                                          1059310.0
112748      112748  ...                                                NaN

[112749 rows x 8 columns]

In [49]:
MTAData.drop(MTAData.columns[MTAData.columns.str.contains('unnamed',case = False)],axis = 1, inplace = True)

clean the the unnamed column

In [50]:
MTAData

             SCP  ... EXITS
0       02-00-00  ...                                          2401758.0
1       02-00-00  ...                                          2401764.0
2       02-00-00  ...                                          2401807.0
3       02-00-00  ...                                          2401889.0
4       02-00-00  ...                                          2401946.0
...          ...  ...                                                ...
112744  00-00-03  ...                                          1058880.0
112745  00-00-03  ...                                          1059059.0
112746  00-00-03  ...                                          1059067.0
112747  00-00-03  ...                                          1059310.0
112748  00-00-03  ...                                                NaN

[112749 rows x 7 columns]

In [51]:
MTAData.head(10)

        SCP  ... EXITS
0  02-00-00  ...                                          2401758.0
1  02-00-00  ...                                          2401764.0
2  02-00-00  ...                                          2401807.0
3  02-00-00  ...                                          2401889.0
4  02-00-00  ...                                          2401946.0
5  02-00-00  ...                                          2401978.0
6  02-00-00  ...                                          2402005.0
7  02-00-00  ...                                          2402008.0
8  02-00-00  ...                                          2402028.0
9  02-00-00  ...                                          2402087.0

[10 rows x 7 columns]

In [52]:
data.head(8)

   Unnamed: 0  ... EXITS
0           0  ...                                          2401758.0
1           1  ...                                          2401764.0
2           2  ...                                          2401807.0
3           3  ...                                          2401889.0
4           4  ...                                          2401946.0
5           5  ...                                          2401978.0
6           6  ...                                          2402005.0
7           7  ...                                          2402008.0

[8 rows x 12 columns]

In [53]:
df=pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/faithful.csv',index_col=0)

In [54]:
df

     eruptions  waiting
1        3.600       79
2        1.800       54
3        3.333       74
4        2.283       62
5        4.533       85
..         ...      ...
268      4.117       81
269      2.150       46
270      4.417       90
271      1.817       46
272      4.467       74

[272 rows x 2 columns]

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 272 entries, 1 to 272
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   eruptions  272 non-null    float64
 1   waiting    272 non-null    int64
dtypes: float64(1), int64(1)
memory usage: 6.4 KB

In [56]:
df.describe

<bound method NDFrame.describe of      eruptions  waiting
1        3.600       79
2        1.800       54
3        3.333       74
4        2.283       62
5        4.533       85
..         ...      ...
268      4.117       81
269      2.150       46
270      4.417       90
271      1.817       46
272      4.467       74

[272 rows x 2 columns]>